app/views/users/show.html.erb

SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 7]]
---
    </ul>
    <% @user.posts.each do |post| %>