app/views/posts/show.html.erb


      <% if Like.find_by(user_id: @current_user.id, post_id: @post.id) %>
---
SELECT  "likes".* FROM "likes" WHERE "likes"."user_id" = ? AND "likes"."post_id" = ? LIMIT ?  [["user_id", 8], ["post_id", 15], ["LIMIT", 1]]