app/controllers/posts_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]
SELECT COUNT(*) FROM "likes" WHERE "likes"."post_id" = ?  [["post_id", 16]]
---
  def show
    @post = Post.find_by(id: params[:id])
    @user = @post.user
    @like_count = Like.where(post_id: @post.id).count

INSERT INTO "posts" ("content", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["content", "20dayonn"], ["created_at", "2021-09-23 22:14:13.564345"], ["updated_at", "2021-09-23 22:14:13.564345"], ["user_id", 7]]
---
  def create
    @post = Post.new(content: params[:content], user_id: @current_user.id)
    if @post.save