app/controllers/users_controller.rb

  def create
    @user = User.new(name: params[:name],
                     email: params[:email],
                     password: params[:password],
                     image_name: "default_user.jpg")
    if @user.save
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at", "image_name", "password") VALUES (?, ?, ?, ?, ?, ?)  [["name", "tomo"], ["email", "45"], ["created_at", "2021-09-21 02:59:30.271102"], ["updated_at", "2021-09-21 02:59:30.271102"], ["image_name", "default_user.jpg"], ["password", "45"]]

  def update
    @user = User.find_by(id: params[:id])
    @user.name = params[:name]
    @user.email = params[:email]
    @user.image_name = "#{@user.id}.jpg"

    if params[:image]
       image = params[:image]
       File.binwrite("public/user_images/#{@user.image_name}", image.read )
    end
    if @user.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
UPDATE "users" SET "image_name" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["image_name", "9.jpg"], ["updated_at", "2021-09-21 12:33:50.139606"], ["id", 9]]